emacs/.config/emacs/config.org
#+TITLE: Literate Emacs Config
#+AUTHOR: Jon Harder
#+STARTUP: show2levels
* Early init optimizations
** Disable built-in package.el
  #+begin_src emacs-lisp :tangle "early-init.el"
    ;; disable package.el in favor of straight.el
    (setq package-enable-at-startup nil)
  #+end_src

  #+RESULTS:

** Startup performance enhancements
   The aim here is to effectively disable the garbage collector during startup
   as emacs is not interactible during startup anyway. In the startup-hook we
   restore these settings to sensible values for runtime.

   #+begin_src emacs-lisp :tangle early-init.el
     (setq gc-cons-threshold most-positive-fixnum
	   gc-cons-percentage 0.5)
   #+end_src

** Performance monitoring
  It's helpful to track how long Emacs takes to load up. This normally
  isn't the most critical metric to track as I usually run emacs with
  ~emacs --daemon~, and open new emacs windows with ~emacsclient~, but
  helpful nonetheless.

  #+begin_src emacs-lisp :tangle "early-init.el"
    (add-hook 'emacs-startup-hook
	      (lambda ()
		(setq gc-cons-threshold (* 1024 1024 20)
		      gc-cons-percentage 0.2)
		(message "*** Emacs loaded in %s with %d garbage collections."
			 (format "%.2f seconds"
				 (float-time
				  (time-subtract after-init-time before-init-time)))
			 gcs-done)))
  #+end_src

* Package management
** Set up straight.el (package management)

   #+begin_src emacs-lisp :tangle "init.el"
   (setq straight-repository-branch "develop")
   
   (defvar bootstrap-version)
   (let ((bootstrap-file
          (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
         (bootstrap-verision 6))
     (unless (file-exists-p bootstrap-file)
       (with-current-buffer
   	(url-retrieve-synchronously
   	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
   	 'silent 'inhibit-cookies)
         (goto-char (point-max))
         (eval-print-last-sexp)))
     (load bootstrap-file nil 'nomessage))
   #+end_src
** Local lisp loading
*** Load local-config
    There are some configuration settings that are local to the particular
    machine I'm running emacs on. These settings are stored in the file,
    =local-config.el=.

    This gets loaded first so that any later configuration can utilize it.

    #+begin_src emacs-lisp :tangle "init.el"
      (load-file (expand-file-name "local-config.el" user-emacs-directory))
    #+end_src
*** Adding my-modules to the load path
    #+begin_src emacs-lisp :tangle "init.el"
    (add-to-list 'load-path (locate-user-emacs-file "my-modules"))
    #+end_src

** Require all my modules
    #+begin_src emacs-lisp :tangle "init.el"
      (require 'my-appearance)
      (require 'my-modeline)
      (require 'my-core)
      (require 'my-evil-config)
      (require 'my-bindings)

      (require 'my-calendar)
      (require 'my-completion)
      (require 'my-tree-sitter)
      (require 'my-denote)
      (require 'my-dired)
      (require 'my-docker-mode)
      (require 'my-ediff)
      (require 'my-email)
      (require 'my-epub)
      (require 'my-gpg)
      (require 'my-help)
      (require 'my-http)
      (require 'my-ibuffer)
      (require 'my-icons)
      (require 'my-lisp-mode)
      (require 'my-git)
      (require 'my-markup)
      (require 'my-navigation)
      (require 'my-nushell-mode)
      (require 'my-org)
      (require 'my-php-mode)
      (require 'my-prog-mode)
      (require 'my-python-mode)
      (require 'my-rest-mode)
      (require 'my-spotify)
      (require 'my-text)

      (require 'my-rust-mode)
      (require 'my-search)
      (require 'my-shells)
      (require 'my-typst)
      (require 'my-terraform-mode)
      (require 'my-util)
      (require 'my-vim-mode)
      (require 'my-xref)
    #+end_src

* Appearance
** Color theme
   The modus theme set is the most complete and polished emacs color theme I've
   encountered. It's also WCAG 2 compliant meaning it will always have high color
   contrast between UI elements, making it one of the easiest themes on the eyes
   in any lighting situation.

   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (straight-use-package my-theme-package)
   #+end_src

*** Settings
**** Basic theme configuration
      #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
	(set-face-attribute 'bold nil :weight 'ultra-bold)
	(when t
	  (custom-set-faces
	   '(org-level-1 ((t (:height 1.6 :inherit outline-1))))
	   '(org-level-2 ((t (:height 1.5 :inherit outline-2))))
	   '(org-level-3 ((t (:height 1.2 :inherit outline-3))))
	   '(org-level-4 ((t (:height 1.1 :inherit outline-4))))
	   '(org-level-5 ((t (:height 1.0 :inherit outline-5))))
	   '(org-document-title ((t (:height 2.0 :underline t))))))
      #+end_src
**** Modus themes settings
     #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
      (progn ;; Modus configuration
	(require-theme 'modus-themes)
	(setq modus-themes-completions
	      '((matches . (extrabold underline))
		(selection . (semibold italic))))
	(setq modus-themes-prompts '(bold))
	(setq modus-themes-bold-constructs t)
	(setq modus-themes-common-palette-overrides
	      modus-themes-preset-overrides-intense)
	(setq modus-themes-variable-pitch-ui nil)
	(setq modus-themes-italic-constructs t)
	(setq modus-themes-org-blocks 'gray-background)
	(setq modus-themes-headings
	      '((1 . (variable-pitch 1.5))
		(2 . (1.3))
		(agenda-date . (1.3))
		(agenda-structure . (variable-pitch light 1.8))
		(t . (1.1)))))
    #+end_src
**** Ef-themes settings
    #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
      (straight-use-package 'ef-themes)
      ;; (setq ef-themes-headings ; read the manual's entry or the doc string
      ;;       '((0 variable-pitch bold 1.9)
      ;; 	(1 variable-pitch bold 1.8)
      ;; 	(2 variable-pitch regular 1.7)
      ;; 	(3 variable-pitch regular 1.6)
      ;; 	(4 variable-pitch light 1.5)
      ;; 	(5 variable-pitch light 1.4) ; absence of weight means `bold'
      ;; 	(6 variable-pitch light 1.3)
      ;; 	(7 variable-pitch light 1.2)
      ;; 	(t variable-pitch light 1.1)
      ;; 	(agenda-date . (1.3))
      ;; 	(agenda-structure . (variable pitch light 1.8))))
    #+end_src

**** Doom themes settings
     #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
       (straight-use-package 'doom-themes)
       (setq doom-rouge-brighter-comments t
	     doom-themes-enable-bold t
	     doom-themes-enable-italic t)
     #+end_src
*** Load theme
    #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
      (load-theme my-theme t)
   #+end_src

** Tweak display of UI elements
*** Menu bar mode

   The menu bar is the list of contextual dropdown options in the top of the
   application (or in the universal top bar on macs).

   I'm all for getting rid of UI clutter, especially if it's unused, but there
   are a lot of features in emacs... Having contextual help aids discoverability,
   and so it stays on.
   
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (menu-bar-mode 1)
   #+end_src
   
*** Scroll bar mode
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (scroll-bar-mode -1)
   #+end_src
*** Tool bar mode
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (tool-bar-mode -1)
   #+end_src

** Frame settings
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (setq frame-resize-pixelwise t
	   frame-inhibit-implied-resize t
	   inhibit-splash-screen t
	   inhibit-startup-screen t)
   #+end_src
** Bells are evil
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (setq ring-bell-function 'ignore)
   #+end_src
** Time display
*** Format
    I like 24 hour time; one time being ambiguous is unnecessarily cumbersome.

   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
      (setq display-time-24hr-format t)
    #+end_src

*** Add the time to the mode line

   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (display-time)
   #+end_src

** Font

   I use FiraCode patched with the Nerd icons

   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (let ((size 175))
       (set-face-attribute 'default nil :font my-font :height size)
       (set-frame-font my-font nil t)
       (add-to-list 'default-frame-alist
		    `(font . ,my-font)))
   #+end_src

** Tabs
   Tabs are a useful workspace organization concept. You can have discrete window/buffer arrangements per tab,
   allowing you to switch between them at will. They are pretty flexible so you could use them for keeping
   track of different projects. Or you could have different window configuations for the same set of buffers
   on different tabs to help with different types of work within the same project.

   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (setq tab-bar-show 1)
   #+end_src
** Spacious Padding
   #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
     (straight-use-package 'spacious-padding)
   #+end_src

** provide the module
  #+begin_src emacs-lisp :tangle "my-modules/my-appearance.el" :mkdirp yes
    (provide 'my-appearance)
  #+end_src
* mode line
** Faces for the modeline
   #+begin_src emacs-lisp :tangle "my-modules/my-modeline.el" :mkdirp yes
     ;; TODO: update faces to make this prettier
     ;; how do you work off of the color palette of the current theme?
     (defface my-modeline-mode-face
       '((t :background "grey50" :foreground "white" :inherit bold))
       "Face for the major mode when displayed in the modeline.")

     (defface my-modeline-buffer-face
       '((t :inherit bold))
       "Face for displaying the buffer name on the modeline.")
     (defface my-modeline-evil-replace-state
       '((t :background "red"))
       "Face to indicate the current evil state is replace.")
     (defface my-modeline-evil-emacs-state
       '((t :background "purple"))
       "Face to indicate the current evil state is Emacs.")

     (defface my-modeline-indicator-blue
       '((default :inherit bold)
	 (((class color) (min-colors 88) (background light))
	  :foreground "#00228a")
	 (((class color) (min-colors 88) (background dark))
	  :foreground "#880bfff")
	 (t :foreground "blue"))
       "Face for modeline indicators")

     (defface my-modeline-indicator-green
       '((default :inherit bold)
	 (((class color) (min-colors 88) (background light))
	  :foreground "#005f00")
	 (((class color) (min-colors 88) (background dark))
	  :foreground "#73fa7f")
	 (t :foreground "green"))
       "Face for modeline indicators")

     (defface my-modeline-indicator-red
       '((default :inherit bold)
	 (((class color) (min-colors 88) (background light))
	  :foreground "#880000")
	 (((class color) (min-colors 88) (background dark))
	  :foreground "#ff9f9f")
	 (t :foreground "red"))
       "Face for modeline indicators")

     (defface my-modeline-indicator-red-bg
       '((default :inherit bold)
	 (((class color) (min-colors 88))
	  :foreground "white" :background "red"))
       "Face for modeline indicators")

     (defface my-modeline-indicator-magenta
       '((default :inherit bold)
	 (((class color) (min-colors 88) (background light))
	  :foreground "#6a1aaf")
	 (((class color) (min-colors 88) (background dark))
	  :foreground "#e0a0ff")
	 (t :foreground "magenta"))
       "Face for modeline indicators")

     (defface my-modeline-indicator-yellow
       '((default :inherit bold)
	 (((class color) (min-colors 88) (background light))
	  :foreground "#6f4000")
	 (((class color) (min-colors 88) (background dark))
	  :foreground "#f0c526")
	 (t :foreground "yellow"))
       "Face for modeline indicators")
   #+end_src

** Helper functions to return strings for display in the modeline 
    #+begin_src emacs-lisp :tangle "my-modules/my-modeline.el" :mkdirp yes
      (defun my-modeline--major-mode-name ()
	"Return the capitalized `major-mode' name."
	(capitalize (string-replace "-mode" "" (symbol-name major-mode))))

      (defun my-modeline--evil-state-name-and-face ()
	"Return a symbol associated with a face to propertize the current evil state."
	(pcase evil-state
	  ('insert '("<I>" my-modeline-indicator-magenta))
	  ('normal '("<N>" my-modeline-indicator-green))
	  ('visual '("<V>" my-modeline-indicator-yellow))
	  ('replace '("<R>" my-modeline-indicator-red))
	  ('emacs '("<E>" my-modeline-evil-emacs-state))))

      (defun my-modeline--buffer-name ()
	"Return the buffer's name."
	(format " %s "(buffer-name)))

      (defun my-modeline--buffer-name-face ()
	(let ((file (buffer-name)))
	  (cond
	   ((and (mode-line-window-selected-p)
		 file
		 (buffer-modified-p))
	    '(italic underline mode-line-buffer-id))
	   ((and file (buffer-modified-p))
	    'italic)
	   ((mode-line-window-selected-p)
	    '(underline mode-line-buffer-id)))))

      (defun my-modeline--major-mode-indicator ()
	(let ((indicator (cond
			  ((derived-mode-p 'text-mode) "ยง")
			  ((derived-mode-p 'prog-mode) "ฮป")
			  ((or (derived-mode-p 'comint-mode)
			       (derived-mode-p 'eshell-mode))
			   ">_"))))
	  (propertize indicator 'face 'shadow)))

      (defun my-modeline--git-branch ()
	"Return propertized git branch."
	(when-let ((branch (car (vc-git-branches))))
	  (propertize branch 'face 'bold)))
    #+end_src

