emacs/.config/emacs/config.org
** Local variables which make up the segments of my modeline
    #+begin_src emacs-lisp :tangle "my-modules/my-modeline.el" :mkdirp yes
      (defvar-local my-modeline-remote
	  '(:eval
	    (when (file-remote-p default-directory)
	      (propertize " @ " 'face 'my-modeline-indicator-red-bg))))


      (defvar-local my-modeline-git-branch
	  '(:eval
	    (if-let (((mode-line-window-selected-p))
		     (branch (my-modeline--git-branch)))
		(list
		 " "
		 (propertize (char-to-string #xE0A0) 'face 'shadow)
		 " "
		 branch
		 " "))))

      (defvar-local my-modeline-evil-state
	  '(:eval
	    (let* ((name-face (my-modeline--evil-state-name-and-face))
		   (name (car name-face))
		   (face (cadr name-face)))
	      (propertize (upcase name) 'face face))))

      (defvar-local my-modeline-major-mode
	  '(:eval
	    (when (mode-line-window-selected-p)
	      (list
	       (my-modeline--major-mode-indicator)
	       " "
	       (propertize (my-modeline--major-mode-name)
			   'face 'my-modeline-buffer-face)))))

      (defvar-local my-modeline-buffer-name
	  '(:eval
	    (list
	     (format "%s" (propertize
			   (my-modeline--buffer-name)
			   'face (my-modeline--buffer-name-face)))
	     " ")))

      (defvar-local my-modeline-date
	  '(:eval
	    (when (mode-line-window-selected-p)
	      (let ((date-time (format-time-string "%H:%M %b %d, %Y")))
		(propertize date-time 'face 'underline)))))

      (defvar-local my-modeline-pos-in-buffer
	  '(:eval
	    (when (mode-line-window-selected-p)
	      (let ((pos (line-number-at-pos)))
		(list
		 (propertize "L" 'face 'bold)
		 (format "%s" pos)
		 " "
		 )))))

      ;; Any variable used in the mode line format MUST be marked as `risky-local-variable'.
      (dolist (component '(my-modeline-git-branch
			   my-modeline-major-mode
			   my-modeline-buffer-name
			   my-modeline-remote
			   my-modeline-evil-state
			   my-modeline-pos-in-buffer
			   my-modeline-date))
	(put component 'risky-local-variable t))
    #+end_src

** The mode line format
     #+begin_src emacs-lisp :tangle "my-modules/my-modeline.el" :mkdirp yes
       ;;; My mode line
       (setq mode-line-right-align-edge 'right-margin)
       (setq-default mode-line-format
		     '("%e"
		       my-modeline-evil-state
		       my-modeline-remote
		       my-modeline-buffer-name
		       my-modeline-major-mode
		       " "
		       my-modeline-git-branch
		       " "
                       my-modeline-pos-in-buffer
		       my-modeline-date))

       ;;; The default mode line
       ;; (setq-default mode-line-format
       ;; 		     '("%e" mode-line-front-space
       ;; 		       (:propertize
       ;; 			("" mode-line-mule-info mode-line-client mode-line-modified
       ;; 			 mode-line-remote)
       ;; 			display (min-width (5.0)))
       ;; 		       mode-line-frame-identification mode-line-buffer-identification "   "
       ;; 		       mode-line-position evil-mode-line-tag (vc-mode vc-mode) "  " mode-line-modes
       ;; 		       mode-line-misc-info mode-line-end-spaces))
     #+end_src
** Provide =my-modeline=
    #+begin_src emacs-lisp :tangle "my-modules/my-modeline.el" :mkdirp yes
      (provide 'my-modeline)
    #+end_src

* Base settings
** Customization file

  Here's just a holding ground for general emacs settings that
  don't seem to fit in any more specific location.

  When emacs makes customizations on my behalf, it throws the
  resultant elist code into my init file. It's great that it
  produces visible, editable, version controllable config, but
  I don't like it in my init file. Let's move it somewhere else.

  #+begin_src emacs-lisp :tangle "my-modules/my-core.el" :mkdirp yes
    (setq custom-file (concat user-emacs-directory "custom.el"))
  #+end_src

** Backups

  Emacs helpfully creates local backups of any files you're editing so that
  if something happens to your session before saving the file, you'll have
  a backup of the local changes.

  It *un*-helpfully defaults to placing them in the same directory as the file
  you are editing. This clutters things up immensely, particularily when you
  are working in a version-controlled project and have to tell your VC tool
  to ignore them.

  Much better to just place them in a dedicated directory and forget about them.
  Emacs will still save the day if something happens, but you don't have to
  worry about it.

  #+begin_src emacs-lisp :tangle "my-modules/my-core.el" :mkdirp yes
    (setq backup-directory-alist '(("." . "~/.backups")))
  #+end_src

** Dictionary

   Emacs has built in dictionary support (because of course it does). By dafault, it
   expects you to be running a dictionary server ~dictd~ locally. If it can't be found,
   it falls back to [[dict.org]]. I'm fine with going over the wire for my definitions,
   so let's just set it as default.

   #+begin_src emacs-lisp :tangle "my-modules/my-core.el" :mkdirp yes
     (setq dictionary-server "dict.org")
   #+end_src

** Provide the module

   #+begin_src emacs-lisp :tangle "my-modules/my-core.el" :mkdirp yes
     (provide 'my-core)
   #+end_src

* Evil (vim)

  Evil mode is the backbone of this configuration. Coming from years
  of vim use, modal editing is burned into my brain stem.

  Fortunately, emacs has some of the best vim emulation of any editor
  or environment around in the way of ~evil-mode~.

** Install the package and enable it

  #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
    (straight-use-package 'evil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (setq evil-undo-system 'undo-redo)
    (evil-mode 1)
  #+end_src

** Starting state for major modes

   Sometimes I want to have some evil state other than =normal= for a particular
   major mode, or the mode might not start in =normal= mode for some reason.
   Regardless, configure thes modes with the desired initial state.

*** Normal modes
   #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (defvar my-normal-modes
       '(Info-mode
	 Man-mode
	 magit-log-mode
	 occur-mode
	 magit-revision-mode
	 git-rebase-mode
	 notmuch-hello-mode
	 notmuch-search-mode
	 notmuch-show-mode
	 ibuffer-mode
	 calendar-mode
	 org-agenda-mode
	 grep-mode)
       "Modes for which evil should begin in normal mode.")

     (dolist (mode my-normal-modes)
       (evil-set-initial-state mode 'normal))
  #+end_src

*** Insert modes
   #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (defvar my-insert-modes
       '(vterm-mode
	 eshell-mode
	 eat-mode)
       "Modes for which evil should begin in insert mode.")

     (dolist (mode my-insert-modes)
       (evil-set-initial-state mode 'insert))
  #+end_src

*** Emacs modes
  #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (defvar my-emacs-modes '()
       "Modes to start in native emacs mode.")

     (dolist (mode my-emacs-modes)
       (evil-set-initial-state mode 'emacs))
   #+end_src

** Cursor shape/color

   It's helpful to set the cursor to different colors and shapes to help remind
   me what evil state I'm currently in.

   /NOTE:/ is there a way to set these colors to something theme compatible?

   #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (setq evil-normal-state-cursor '(box "light blue")
	   evil-insert-state-cursor '(bar "medium sea green")
	   evil-visual-state-cursor '(hollow "orange"))
   #+end_src

** Leader key

  The leader key is a super handy global prefix for keybindings.
  It's used in this configuration as the entrypoint for most bindings.

  After entering the leader key =SPC=, bindings are further subdivided
  by the logical operations or object those bindings act on.

  | _binding_ | _action_                           |
  |---------+----------------------------------|
  | SPC a   | application launcher             |
  | SPC b   | buffer actions                   |
  | SPC c   | config actions                   |
  | SPC d   | dired actions                    |
  | SPC e   | evaluation actions               |
  | SPC f   | file based actions               |
  | SPC g   | magit                            |
  | SPC h   | help actions                     |
  | SPC m   | [reserved] mode specific actions |
  | SPC o   | org actions                      |
  | SPC t   | tab actions                      |
  | SPC w   | window based actions             |

  #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
    (evil-set-leader 'normal (kbd "<SPC>"))
  #+end_src

** Evil surround
  #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
    (straight-use-package 'evil-surround)
    (global-evil-surround-mode 1)
  #+end_src

** Evil numbers

   For some reason, vim's increment and decrement number functionality
   is not replicated by evil. This package just re-introduces that
   behavior

   #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (straight-use-package 'evil-numbers)
     (define-key evil-normal-state-map (kbd "C-a") #'evil-numbers/inc-at-pt)
     (define-key evil-normal-state-map (kbd "C-x") #'evil-numbers/dec-at-pt)
   #+end_src

** Evil comments
  #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
    (straight-use-package 'evil-commentary)
    (evil-commentary-mode)
    (evil-define-key '(insert normal visual) evil-commentary-mode-map (kbd "s-;") #'evil-commentary-line)
  #+end_src
** Provide the module
  
   #+begin_src emacs-lisp :tangle "my-modules/my-evil-config.el" :mkdirp yes
     (provide 'my-evil-config)
   #+end_src

* Calendar
** Base settings

   Set the date style to iso (day month year).

   #+begin_src emacs-lisp :tangle "my-modules/my-calendar.el" :mkdirp yes
     (setq calendar-date-style 'iso)
   #+end_src
** Bindings
   #+begin_src emacs-lisp :tangle "my-modules/my-calendar.el" :mkdirp
     (evil-define-key 'normal calendar-mode-map
       (kbd "l") 'calendar-forward-day
       (kbd "h") 'calendar-backward-day
       (kbd "w") #'calendar-forward-week
       (kbd "b") #'calendar-backward-week
       (kbd "k") 'calendar-backward-week
       (kbd "j") 'calendar-forward-week
       (kbd "q") 'calendar-exit
       (kbd "0") 'calendar-beginning-of-week
       (kbd "$") 'calendar-end-of-week
       (kbd ".") 'calendar-goto-today
       (kbd "d d") 'diary-view-entries
       (kbd "d i") 'diary-insert-entry)
   #+end_src
** Diary

   The diary is (for me) mostly a way to jot down an appointment or reminder.

  #+begin_src emacs-lisp :tangle "my-modules/my-calendar.el" :mkdirp yes
     (appt-activate 1)

     (evil-define-key 'normal diary-fancy-display-mode-map
       (kbd "q") 'quit-window)
   #+end_src

** Provide the module

  #+begin_src emacs-lisp :tangle "my-modules/my-calendar.el" :mkdirp yes
    (provide 'my-calendar)
  #+end_src
* Completion

** General minibuffer settings

   When interacting with the [[elisp:(info "(emacs) Minibuffer")][minibuffer]], you may want to execute a command
   that itself occupies the minibuffer. Enabling recursive-minibuffers allows
   for you to nest arbitrarily deep minibuffer commands.

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (setq enable-recursive-minibuffers t)
   #+end_src

   When you've used a command once, you will probably use it again in the near
   future. savehist is a simple package that remembers and promotes recent
   commands to the top of the prompted list of completions.

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (straight-use-package 'savehist)
     (savehist-mode)
   #+end_src

   Do not allow the cursor in the minibuffer

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (setq minibuffer-prompt-properties
	   '(read-only t cursor-intangible t face minibuffer-prompt))
     (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
   #+end_src
   
** Vertico

   Vertico is a minibuffer completion enhancement library which wraps emacs'
   built in [[elisp:(info "(emacs) Completion")][completion]] functionality. It is a member of a new era of packages
   which seek to enhance existing methods in emacs, rather than replace them
   entirely (looking at you helm).

   Vertico specifically seeks to enhance `completing-read', a generic method
   that prompts users to select from one of a provided set of alternatives.

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (straight-use-package 'vertico)
     (vertico-mode 1)
     (define-key vertico-map (kbd "<escape>") #'keyboard-escape-quit)
   #+end_src

   Vertico also has a small stable of add-ons which change the default
   UI or behavior of vertico. Here vertico-directory is enabled, which
   introduces commands to delete directories fragments of the prompted
   file-path.

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (require 'vertico-directory)
     (define-key vertico-map (kbd "DEL") #'vertico-directory-delete-char)
     (define-key vertico-map (kbd "RET") #'vertico-directory-enter)
   #+end_src

   Wipe the shadowed input in minibuffer when the current input superscedes
   it, e.g. =~/some/path/~/base= should erase =~/some/path= since =~/base= shadows
   it.

   #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy)
   #+end_src

** Corfu

  Corfu offers completion in buffer, replacing company mode which sidesteps
  Emacs' built in completion mechanisms.

  #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
    (straight-use-package 'corfu)
    (setq corfu-auto t
	  corfu-separator ?\s
	  tab-always-indent 'complete)
    (global-corfu-mode 1)
  #+end_src

** Marginalia

   Marginalia is a small package that adds contextual information "in the margins"
   of the completion. It is a perfect compliment to the work of vertico (or
   other completion frameworks, it doesn't care)

   This means file prompts will contain file permissions, last modified time,
   file size. Commands will display their doc string, etc.

  #+begin_src emacs-lisp :tangle "my-modules/my-completion.el" :mkdirp yes
     (straight-use-package 'marginalia)
     (marginalia-mode 1)
   #+end_src

