emacs/.config/emacs/config.org
**** Message mode
      This is the mode which handles actually composing messages.

      #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
	(evil-define-key 'normal notmuch-message-mode-map
	  (kbd "<leader> m a") #'mail-add-attachment)
      #+end_src
    
** Provide =my-email=
  #+begin_src emacs-lisp :tangle "my-modules/my-email.el" :mkdirp yes
    (provide 'my-email)
  #+end_src
* Text
** Mixed pitch mode
    Variable pitch (or proportional) fonts are those fonts which have
    different widths on a per-character basis. These are typically
    better for prose.

    Fixed pitch fonts are those which have the same width for each
    character. This means code formatting is preserved relative to
    each line, and does not vary on which letters are typed. This
    tends to be preferred for code.

    Using variable pitch fonts in text-inheriting modes is nice, but
    results in things like org source blocks using the same variable
    pitch as your prose.

    Fortunately, the ~mixed-pitch~ package is aware of the different
    font requirements of such modes and will use both variable and
    fixed pitch fonts in the same buffer according to use.

    #+begin_src emacs-lisp :tangle "my-modules/my-text.el" :mkdirp yes
      (straight-use-package 'mixed-pitch)
    #+end_src

** Fill column
   Auto-fill mode uses a fixed column number to inform when emacs will
   insert a newline.

   Lets set it to something reasonable.

   #+begin_src emacs-lisp :tangle "my-modules/my-text.el" :mkdirp yes
     (set-fill-column 80)
   #+end_src
** Text-mode hook
  #+begin_src emacs-lisp :tangle "my-modules/my-text.el" :mkdirp yes
    (defun my-text-mode-hook ()
      (auto-fill-mode 1)
      (flyspell-mode 1))

    (add-hook 'text-mode-hook #'my-text-mode-hook)
  #+end_src

** Provide =my-text=
  #+begin_src emacs-lisp :tangle "my-modules/my-text.el" :mkdirp yes
    (provide 'my-text)
  #+end_src
* Miscellanious functions
  This is a collection of random functions I've written to help me run one-off tasks.
  
  #+begin_src emacs-lisp :tangle "my-modules/my-util.el" :mkdirp yes
    (defun find-config ()
      "Open the user's config file."
      (interactive)
      (find-file (concat user-emacs-directory "config.org")))

  #+end_src

  This is a small convenience method to load the mastering emacs epub:

  #+begin_src emacs-lisp :tangle "my-modules/my-util.el" :mkdirp yes
    (defun masteringemacs ()
      "Open the masteringemacs epub manual."
      (interactive)
      ;; ensure the nov package is installed
      (require 'nov)
      (find-file "~/Dropbox/Emacs/mastering-emacs-v4.epub"))
  #+end_src

  And provide the module

  
  #+begin_src emacs-lisp :tangle "my-modules/my-util.el" :mkdirp yes
    (provide 'my-util)
  #+end_src

* Magit (git)
  Magit is amazing
  
*** Install the package

  #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
    (straight-use-package 'magit)
    (evil-set-initial-state 'magit-status-mode 'normal)
  #+end_src

*** Set up bindings for the various magit modes
**** Status mode
    Normal mode bindings

    #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
      (evil-define-key '(normal motion) magit-status-mode-map
	(kbd "?") #'magit-dispatch
	(kbd "b") #'magit-branch
	(kbd "q") #'magit-mode-bury-buffer
	(kbd "c") #'magit-commit
	(kbd "e") #'magit-ediff-dwim
	(kbd "j") #'magit-next-line
	(kbd "k") #'magit-previous-line
	(kbd "}") #'magit-section-forward
	(kbd "{") #'magit-section-backward
	(kbd "TAB") #'magit-section-toggle
	(kbd "RET") #'magit-visit-thing
	(kbd "i") #'magit-gitignore
	(kbd "l") #'magit-log
	(kbd "m") #'magit-merge
	(kbd "P") #'magit-push
	(kbd "p") #'magit-pull
	(kbd "M") #'magit-remote
	(kbd "r") #'magit-rebase
        (kbd "t") #'magit-tag
	(kbd "R") #'magit-reset
	(kbd "$") #'magit-process-buffer
	;; delete
	(kbd "d d") 'magit-discard
	(kbd "z") #'magit-stash)
    #+end_src

    Visual mode bindings

    #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
      (evil-define-key '(normal visual) magit-status-mode-map
    	(kbd "s") 'magit-stage
    	(kbd "u") 'magit-unstage)
    #+end_src

**** Log mode
    Normal mode bindings

    #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
      (evil-define-key '(normal motion) magit-log-mode-map
        (kbd "q") 'magit-log-bury-buffer
        (kbd "r") 'magit-rebase
        (kbd "j") 'magit-next-line
        (kbd "k") 'magit-previous-line
        (kbd "}") 'magit-section-forward
        (kbd "{") 'magit-section-backward
        (kbd "RET") 'magit-show-commit
        (kbd "f") #'magit-fetch)
    #+end_src

**** Rebase mode
    #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
      (evil-define-key '(normal) git-rebase-mode-map
	(kbd "p") #'git-rebase-pick
	(kbd "b") #'git-rebase-break
        (kbd "e") #'git-rebase-edit
	(kbd "dd") #'git-rebase-kill-line
	(kbd "s") #'git-rebase-squash
        (kbd "r") #'git-rebase-reword
	(kbd "f") #'git-rebase-fixup
	(kbd "J") #'git-rebase-move-line-down
	(kbd "K") #'git-rebase-move-line-up)
    #+end_src

**** Revision mode
    The revision mode im magit is TODO (what actual part of magit does this even relate to?)
    
    #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
      (evil-define-key '(normal motion) magit-revision-mode-map
	(kbd "j") 'magit-next-line
	(kbd "k") 'magit-previous-line
	(kbd "}") 'magit-section-forward
	(kbd "{") 'magit-section-backward
	(kbd "TAB") 'magit-section-toggle
	(kbd "RET") 'magit-visit-thing
	(kbd "q") 'magit-mode-bury-buffer)
    #+end_src

** Forge
    Forges are a term representing a centralized version control
    location, like github. Magit bundles support for viewing content
    from forges (like pull requests), when required.

    #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
      (straight-use-package 'forge)
    #+end_src
    
** Git gutters
    #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
      (straight-use-package 'git-gutter)
      (global-git-gutter-mode)
    #+end_src
** Provide =my-git=
   #+begin_src emacs-lisp :tangle "my-modules/my-git.el" :mkdirp yes
     (provide 'my-git)
   #+end_src

* Help utilities
  This encompasses man pages, info pages, describe-* windows, etc.
** Helpful package
    #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp
      (straight-use-package 'helpful)

      (evil-define-key '(normal motion) helpful-mode-map
	(kbd "q") #'quit-window)

      (evil-define-key '(normal motion) help-mode-map
	(kbd "q") #'quit-window)
    #+end_src
** Info
*** Bindings
    #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp yes
      (evil-define-key '(normal motion) Info-mode-map
	(kbd "<tab>") 'Info-next-reference
	(kbd "S-<tab>") 'Info-prev-reference
	(kbd "RET") 'Info-follow-nearest-node
	(kbd "d") 'Info-directory
	(kbd "u") 'Info-up
	(kbd "s") 'Info-search
	(kbd "i") 'Info-index
	(kbd "a") 'info-apropos
	(kbd "q") 'quit-window

        (kbd "y y") 'Info-copy-current-node-name

	[mouse-1] 'Info-mouse-follow-nearest-node
	[follow-link] 'mouse-face
	;; goto
	(kbd "g m") 'Info-menu
	(kbd "g t") 'Info-top-node
	(kbd "g T") 'Info-toc
	(kbd "g j") 'Info-next
	(kbd "g k") 'Info-prev)
    #+end_src
** Man
*** Bindings
     #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp yes
       (evil-define-key 'normal Man-mode-map
	 (kbd "q") #'quit-window)
     #+end_src

** Provide =my-help=
   #+begin_src emacs-lisp :tangle "my-modules/my-help.el" :mkdirp yes
     (provide 'my-help)
   #+end_src

* Ibuffer
  Ibuffer is an interactive buffer viewer which allows for searching, filtering
  and acting on all of the open buffers in your session.

** Bindings
  #+begin_src emacs-lisp :tangle "my-modules/my-ibuffer.el" :mkdirp yes
    (evil-define-key '(normal motion) ibuffer-mode-map
      (kbd "<leader> x") 'execute-extended-command
      ;; navigation
      (kbd "{") 'ibuffer-backwards-next-marked
      (kbd "}") 'ibuffer-forward-next-marked
  
      ;; mark commands
      (kbd "J") 'ibuffer-jump-to-buffer
      (kbd "m") 'ibuffer-mark-forward
      (kbd "~") 'ibuffer-toggle-marks
      (kbd "u") 'ibuffer-unmark-forward
      (kbd "DEL") 'ibuffer-unmark-backward
      (kbd "* *") 'ibuffer-mark-special-buffers
      (kbd "U") 'ibuffer-unmark-all-marks
      (kbd "* m") 'ibuffer-mark-by-mode
      (kbd "* M") 'ibuffer-mark-modified-buffers
      (kbd "* r") 'ibuffer-mark-read-only-buffers
      (kbd "* /") 'ibuffer-mark-dired-buffers
      (kbd "* h") 'ibuffer-mark-help-buffers
      (kbd "d") 'ibuffer-mark-for-delete
  
      ;; actions
      (kbd "x") 'ibuffer-do-kill-on-deletion-marks
      (kbd "gr") 'ibuffer-update
  
      ;; immediate actions
      (kbd "A") 'ibuffer-do-view
      (kbd "D") 'ibuffer-do-delete
      (kbd "K") 'ibuffer-do-kill-lines)
  #+end_src

** Provide =my-ibuffer=
  #+begin_src emacs-lisp :tangle "my-modules/my-ibuffer.el" :mkdirp yes
    (provide 'my-ibuffer)
  #+end_src

* Bindings
** Global bindings
   Visual/emacs state commands

   #+begin_src emacs-lisp :tangle "my-modules/my-bindings.el" :mkdirp yes
    (evil-define-key '(insert emacs visual) 'global
      (kbd "s-x") #'execute-extended-command)
   #+end_src

   Normal state commands
   
   #+begin_src emacs-lisp :tangle "my-modules/my-bindings.el" :mkdirp yes
     (evil-define-key 'normal 'global
       (kbd "<leader> ;") #'eval-expression
       (kbd "<leader> q") #'save-buffers-kill-terminal
       (kbd "<leader> x") #'execute-extended-command
       (kbd "g r") #'revert-buffer
       ;; App launcher
       (kbd "<leader> a c") #'calendar
       (kbd "<leader> a a") #'org-agenda
       (kbd "<leader> a n") #'notmuch
       (kbd "<leader> a =") #'calc
       ;;; spotify
       (kbd "<leader> a s") #'smudge-command-map
       ;; buffers
       (kbd "<leader> b b") #'consult-buffer
       (kbd "<leader> b n") #'next-buffer
       (kbd "<leader> b p") #'previous-buffer
       (kbd "<leader> b s") #'save-buffer
       (kbd "<leader> b i") #'ibuffer
       (kbd "<leader> b d") #'evil-delete-buffer
       (kbd "<leader> b k") #'kill-current-buffer
       (kbd "<leader> b r") #'rename-buffer
       ;; config related commands
       (kbd "<leader> c .") #'find-config
       (kbd "<leader> c r") (lambda () (interactive) (load-file user-init-file))
       (kbd "<leader> c t") #'consult-theme
       ;; dired
       (kbd "<leader> d d") #'dired-jump
       (kbd "<leader> d j") #'dired
       ;; evaluation
       (kbd "<leader> e e") #'eval-last-sexp
       (kbd "<leader> e d") #'eval-deful
       ;; files
       (kbd "<leader> f b") #'bookmark-jump
       (kbd "<leader> f i") (lambda () (interactive) (find-file "~/Dropbox/Work/index.org"))
       (kbd "<leader> f B") #'bookmark-set
       (kbd "<leader> f c") #'find-config
       (kbd "<leader> f f") #'find-file
       ;; magit
       (kbd "<leader> g") #'magit
       ;; help(ful) commands
       (kbd "<leader> h i") (lambda (node) (interactive "MNode: ")
			      (info (format "(%s)Top" node)))
       (kbd "<leader> h M") #'info-emacs-manual
       (kbd "<leader> h v") #'helpful-variable
       (kbd "<leader> h f") #'helpful-function
       (kbd "<leader> h k") #'helpful-key
       (kbd "<leader> h m") #'describe-mode
       (kbd "<leader> h r") #'info-display-manual
       ;; imenu
       (kbd "<leader> i") #'consult-imenu
       ;; jumping (ace)
       (kbd "<leader> j") #'ace-jump-word-mode
       ;; org
       (kbd "<leader> o c") #'org-capture
       ;; occur
       (kbd "<leader> o o") #'occur
       ;; project
       (kbd "<leader> p !") #'project-shell-command
       (kbd "<leader> p &") #'project-async-shell-command
       (kbd "<leader> p D") #'project-dired
       (kbd "<leader> p b") #'project-switch-to-buffer
       (kbd "<leader> p d") #'project-find-dir
       (kbd "<leader> p e") #'project-eshell
       (kbd "<leader> p f") #'project-find-file
       (kbd "<leader> p m") #'magit-project-status
       (kbd "<leader> p k") #'project-kill-buffers
       (kbd "<leader> p p") #'project-switch-project
       (kbd "<leader> p /") #'project-find-regexp
       ;; shells
       (kbd "<leader> s e") #'eshell
       ;;; (kbd "<leader> s t") #'eat
       (kbd "<leader> s t") #'multi-vterm
       ;; tab commands
       (kbd "<leader> t t") #'tab-switch
       (kbd "<leader> t n") #'tab-new
       (kbd "<leader> t c") #'tab-close
       (kbd "<leader> t j") #'tab-next
       (kbd "<leader> t k") #'tab-previous
       (kbd "<leader> t f") #'find-file-other-tab
       (kbd "<leader> t b") #'switch-to-buffer-other-tab
       (kbd "<leader> t r") #'tab-rename
       (kbd "<leader> t d") #'dired-other-tab
       ;; windows
       (kbd "<leader> .") #'evil-window-split
       (kbd "<leader> /") #'evil-window-vsplit
       (kbd "<leader> w w") #'ace-window
       (kbd "<leader> w H") #'evil-window-move-far-left
       (kbd "<leader> w L") #'evil-window-move-far-right
       (kbd "<leader> w K") #'evil-window-move-very-top
       (kbd "<leader> w J") #'evil-window-move-very-bottom
       (kbd "<leader> w c") #'evil-window-delete
       (kbd "<leader> w v") #'evil-window-vsplit
       (kbd "<leader> w s") #'evil-window-split
       (kbd "<leader> w o") #'delete-other-windows
       ;; toggles
       (kbd "<leader> T t") #'modus-themes-toggle
       (kbd "<leader> T n") #'display-line-numbers-mode
       (kbd "<leader> T s") #'spacious-padding-mode
       (kbd "<leader> T w") #'whitespace-mode)
   #+end_src

*** S-expression navigation

   #+begin_src emacs-lisp :tangle "my-modules/my-bindings.el" :mkdirp yes
     (evil-define-key 'normal 'global
       "s" nil)
     (evil-define-key 'normal 'global
       ;; (kbd "s l") #'forward-sexp
       (kbd "s h") #'backward-sexp
       (kbd "s j") #'down-list
       (kbd "s k") #'backward-up-list
       (kbd "s d") #'kill-sexp
       (kbd "s $") #'forward-sentence
       (kbd "s 0") #'backward-sentence)
   #+end_src


